---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.FabricationEndOffsetParam
source: html/e3d18dea-2aa4-b9bf-e548-861eca661642.htm
---
# Autodesk.Revit.DB.ParameterTypeId.FabricationEndOffsetParam Property

"End Middle Elevation"

## Syntax (C#)
```csharp
public static ForgeTypeId FabricationEndOffsetParam { get; }
```